{
    "speakers": [
        {
            "id": "cyrilmottier",
            "bio": "Cyril Mottier is Mobile Software Engineer at Capitaine Train and Android Google Developer Expert. Passionate about technology and design, Cyril is an avid lover of Android and a multi-skilled engineer. He is actively involved in the Android community and shares his passion writing blog posts, creating open source librairies and giving talks. His motto: “Do less, but do it insanely great",
            "name": "Cyril Mottier",
            "company": "Capitaine Train",
            "plusoneUrl": "https://plus.google.com/+CyrilMottier",
            "website": "http://cyrilmottier.com/",
            "twitter": "https://twitter.com/cyrilmottier",
            "thumbnailUrl": "https://lh3.googleusercontent.com/-LWYaRkiLVvM/Ut48DO9cP1I/AAAAAAAAQkU/HvZg4UrVXtI/s500-no/me.jpg"
        },
        {
            "id": "xavierhallade",
            "bio": "Xavier Hallade is Developer Evangelist in Intel Software and Service Group in Paris, France. He is helping developers to improve their support for new hardware and technologies backed by Intel, with a focus on the Android NDK, 64-bit and wireless displays.",
            "name": "Xavier Hallade",
            "company": "Intel",
            "plusoneUrl": "https://plus.google.com/+XavierHallade",
            "website": "http://ph0b.com/",
            "twitter": "https://twitter.com/ph0b",
            "thumbnailUrl": "http://fr.droidcon.com/2014/wp-content/uploads/2014/07/Xavier-Hallade.jpg"
        },
        {
            "id": "janchong",
            "bio": "Jan Chong holds a BS and MS in Computer Science from Stanford University. She has Ph.D from the Management Science & Engineering Department, also from Stanford. She is currently the Engineering Manager for the Twitter Android Team. Prior to joining Twitter, Jan ran client and server software development at OnLive.",
            "name": "Jan Chong",
            "company": "Twitter",
            "plusoneUrl": "https://plus.google.com/107409019686006760010",
            "website": "",
            "twitter": "https://twitter.com/lessachu",
            "thumbnailUrl": "http://fr.droidcon.com/2014/wp-content/uploads/2014/07/Jan-Chong-222x222.png"
        },
        {
            "id": "taylorling",
            "bio": "Taylor is very passionate about User Experience (UX), not so much on the ethnography part, but more on the User Interface execution that can directly influence UX and Usability, particularly on the mobile devices (Android always come first!). He is currently the GDE for UX/Design, and enjoys going around the world to share his experience on UI/UX Design. He is currently crafting pixels at snappymob.com.",
            "name": "Taylor Ling",
            "company": "Snappymob",
            "plusoneUrl": "https://plus.google.com/+TaylorLing",
            "website": "http://androiduiux.com/",
            "twitter": "https://twitter.com/taylorling",
            "thumbnailUrl": "http://fr.droidcon.com/2014/wp-content/uploads/2014/07/Taylor-Ling-final-222x222.png"
        },
        {
            "id": "stephanenicolas",
            "bio": "Stéphane Nicolas is Senior Android Developer at Groupon, specialized in the development of Android applications for smartphones and tablets. With almost 15 years’ experience in Java, he contributed or initiated different Open Source projects for Android (like RoboSpice, RoboDemo, Android Maven Plugin, RoboGuice etc) or commercial applications. He actively participates to the Android community and contributes to the integration of the Android platform and advanced industrialized programming techniques such as Sonar, Maven, Jenkins etc.",
            "name": "Stéphane Nicolas",
            "company": "Groupon",
            "plusoneUrl": "https://plus.google.com/+StéphaneNICOLAS-OnG",
            "website": "",
            "twitter": "",
            "thumbnailUrl": "http://fr.droidcon.com/2014/wp-content/uploads/2014/08/st%C3%A9phane-nicolas-222x222.jpg"
        },
        {
            "id": "fabiendevos",
            "bio": "Fabien Devos started to work in Paris by developing applications such as Le Monde, AlloCiné, Crédit Agricole and the renowned Dailymotion. Then, he moved to London and joined the startup Lightbox, which has since been bought by Facebook for which he worked for one year in the Framework Android Team in California. He currently works for the Startup Upthere in cloud computing, founded by Bertrand Serlet.",
            "name": "Fabien Devos",
            "company": "Upthere",
            "plusoneUrl": "https://plus.google.com/116057947663114842022",
            "website": "",
            "twitter": "https://twitter.com/Fabien_Devos",
            "thumbnailUrl": "http://fr.droidcon.com/2014/wp-content/uploads/2014/07/Fabien-Devos-222x222.jpg"
        },
        {
            "id": "guillaumelaforge",
            "bio": "Guillaume Laforge is the project lead of the Open Source Groovy programming language for the Java platform, the most widely used alternative language of the Java platform. Guillaume works for Pivotal, and is the co-author of the best-seller « Groovy in Action » book. He often speaks at conference worldwide about Groovy related matters.",
            "name": "Guillaume Laforge",
            "company": "Pivotal",
            "plusoneUrl": "https://plus.google.com/+GuillaumeLaforge",
            "website": "",
            "twitter": "https://twitter.com/glaforge",
            "thumbnailUrl": "http://fr.droidcon.com/2014/wp-content/uploads/2014/08/Guillaume-Laforge-222x222.png"
        },
        {
            "id": "nabilhachicha",
            "bio": "Developer of SnappyDB.com which is a NoSQL database for Android, Nabil works as an Android software engineer at The App Business in London.",
            "name": "Nabil Hachicha",
            "company": "The App Business",
            "plusoneUrl": "https://plus.google.com/110610526826489061446",
            "website": "",
            "twitter": "https://twitter.com/nabil_hachicha",
            "thumbnailUrl": "http://fr.droidcon.com/2014/wp-content/uploads/2014/07/Nabil-Hachicha-222x222.jpg"
        },
        {
            "id": "geoffreydorne",
            "bio": "Geoffrey will be presenting how design impacts our lives while creating products, services or experiences.",
            "name": "Geoffrey Dorne",
            "company": "Design & Human",
            "plusoneUrl": "https://plus.google.com/116718314329691158716",
            "website": "http://designandhuman.com/",
            "twitter": "https://twitter.com/GeoffreyDorne",
            "thumbnailUrl": "http://fr.droidcon.com/2014/wp-content/uploads/2014/07/Geoffrey-Dorne-222x222.jpg"
        },
        {
            "id": "marcdecourville",
            "bio": "Archos is a French company and has been a player in the Android arena since Android 1.5. The company was the first one to introduce Android tablets onto the market and a Google certified Android TV (Archos TV Connect). Archos is now a recognized brand for Android based tablets, phones and recently for Android based connected home solutions.",
            "name": "Marc de Courville",
            "company": "Archos",
            "plusoneUrl": "https://plus.google.com/+MarcdeCourville",
            "website": "",
            "twitter": "https://twitter.com/marcdecourville",
            "thumbnailUrl": "https://lh6.googleusercontent.com/-gW61S7OilRU/Ukrbut8uhqI/AAAAAAAAAMk/tvCi34Iq8JM/w661-h655-no/MarcDeCourville_3.jpg"
        },
        {
            "id": "jbkempf",
            "bio": "Jean-Baptiste Kempf is the president of the VideoLAN non-profit organization and one of the main developers of VLC. Jean-Baptiste led some of the ports of VLC on mobile devices, including the Android port, and is the current release manager of VLC.",
            "name": "Jean-Baptiste Kempf",
            "company": "VideoLAN",
            "plusoneUrl": "https://plus.google.com/100674486160360423322",
            "website": "",
            "twitter": "",
            "thumbnailUrl": "https://lh5.googleusercontent.com/-M1Mwx3wQnB0/T6ptwS8gRiI/AAAAAAAAAEQ/eV7RBejAH48/w652-h655-no/JB-IMG_1103_DxO_1-Resize.jpg"
        },
        {
            "id": "timmesserschmidt",
            "bio": "As a long time mobile and web developer, Tim channels his knowledge and experience as PayPal’s Lead Developer Evangelist in EMEA. He is passionate about startups and serves as mentor at multiple incubators and accelerators. Prior joining PayPal Tim used to work with Neofonie Mobile and Samsung focussing on several mobile projects. In his spare time, he leads and creates training classes in all sorts of developer-oriented topics, contributes to Open Source projects and is one of the authors of the Mobile Developer’s Guide to the Galaxy, as well as numerous articles published in print magazines.",
            "name": "Tim Messerschmidt",
            "company": "PayPal",
            "plusoneUrl": "https://plus.google.com/+TimMesserschmidt",
            "website": "",
            "twitter": "https://twitter.com/SeraAndroid",
            "thumbnailUrl": "https://lh4.googleusercontent.com/-G0EKTKz1vGI/UW6XHy-ncVI/AAAAAAAALbQ/quBFmBndiD4/w654-h655-no/IMG_0843_web.jpg"
        },
        {
            "id": "hoilam",
            "bio": "Hoi is a Senior Developer Advocate at Google for Wearables including both Android Wear and Google Glass. He previously worked on Google Cast where he was part of the launch team for both the Google Cast SDK and Chromecast in Europe. Prior to joining Google, he founded Exahive to disrupt the mobile commerce marketplace with new technology and business models. Hoi was an Equity Research VP at Deutsche Bank and Citigroup between 2007-2012 advising technology CEOs, CFOs on corporate strategy and institutional investors on technology investments. Before banking, he was an enterprise architect at Accenture heading up product management for large client programmes. Hoi holds a Master and Bachelor degree in Space Engineering from the University of Cambridge.",
            "name": "Hoi Lam",
            "company": "Google",
            "plusoneUrl": "https://plus.google.com/+HoiLam",
            "website": "",
            "twitter": "https://twitter.com/hcl21",
            "thumbnailUrl": "https://lh4.googleusercontent.com/-VUBOaPF8tcM/UV3-2sDPqhI/AAAAAAAAU-E/GHTsNmt2__o/w653-h655-no/20090802-DSC_8688.png"
        },
        {
            "id": "marioviviani",
            "bio": "Mario Viviani, Android Developer since 2010, has been nominated Google Developer Expert (GDE) for Android by Google in 2013. Mario has published more than 90 apps on Google Play. In 2011 Mario decided to create the startup Mariux Apps, based in Milan, Italy, focused on Mobile Applications Development. He is member of Talent Garden, a network of co-working spaces focused on digital and innovation. As Mariux Apps his products received 12.000.000+ total downloads and are currently ranked in the Top 100 apps in a lot of Categories in Google Play. At Mariux Apps he is also working with cutting edge technologies like Google Glass and Leap Motion. Mario is really active in the Android community, attending a lot of events worldwide, helping Android developers build new, compelling and well-received apps.",
            "name": "Mario Viviani",
            "company": "Mariux Apps",
            "plusoneUrl": "https://plus.google.com/+MarioViviani",
            "website": "",
            "twitter": "https://twitter.com/Mariuxtheone",
            "thumbnailUrl": "http://fr.droidcon.com/2014/wp-content/uploads/2014/07/Mario-Viviani-222x222.jpg"
        },
        {
            "id": "cedriccreusot",
            "bio": "Cédric has always been fond of Mobile Development and he has a few years experience in the development of Android applications but he also wanted to try the “freelance experience” by creating video games himself. After that, he joined Meetic and he now is in charge of the development of Android applications, convinced that working in a team is more efficient and fun than on his own!",
            "name": "Cédric Creusot",
            "company": "Meetic",
            "plusoneUrl": "",
            "website": "",
            "twitter": "",
            "thumbnailUrl": "http://fr.droidcon.com/2014/wp-content/uploads/2014/07/C%C3%A9dric-Creusot-222x222.jpg"
        },
        {
            "id": "jeanloupyu",
            "bio": "Jean-Loup is fond of new technologies and he has been specializing in Mobile for a few years. He is currently the Head of Development for Mobile Applications at Meetic. Prior to Meetic, he worked as a consultant for many influential companies in the Media and Internet world. He joined Meetic to implement the Mobile Strategy of the group.",
            "name": "Jean-Loup Yu",
            "company": "Meetic",
            "plusoneUrl": "https://plus.google.com/112882583085432640120",
            "website": "",
            "twitter": "https://twitter.com/djelmen",
            "thumbnailUrl": "http://fr.droidcon.com/2014/wp-content/uploads/2014/07/Jean-Loup-Yu-222x222.jpg"
        },
        {
            "id": "thomasguerin",
            "bio": "Consultant at Xebia since 2011, Thomas is fond of Android development and enthusiastic of good development practices. He is really interested in continuous deployment on Mobile phones.",
            "name": "Thomas Guerin",
            "company": "Xebia",
            "plusoneUrl": "https://plus.google.com/112041335454373673694",
            "website": "",
            "twitter": "https://twitter.com/Tom404_",
            "thumbnailUrl": "http://fr.droidcon.com/2014/wp-content/uploads/2014/07/Thomas-Guerin-222x222.jpg"
        },
        {
            "id": "benjaminaugustin",
            "bio": "Benjamin is an aspiring Software Craftsman and Android developer at Novoda. He is convinced that functional programming has a lot to teach us on our everyday work.",
            "name": "Benjamin Augustin",
            "company": "Novoda",
            "plusoneUrl": "https://plus.google.com/113116875847268618115",
            "website": "",
            "twitter": "https://twitter.com/Dorvaryn",
            "thumbnailUrl": "http://fr.droidcon.com/2014/wp-content/uploads/2014/07/Benjamin-Augustin-222x222.jpg"
        },
        {
            "id": "sebastianopoggi",
            "bio": "A self-taught and strong OSS believer who loves beautiful and simple UX and UI, where “less is more”, Sebastiano spends a big chunk of his spare time reading and writing about Android development. He also creates and maintains some FOSS apps and libraries, that span from the fun, smaller projects to the more serious (and, perhaps, useful) work. Sebastiano worked some time in AKQA as a Senior Software Engineer. Before moving to London, he also worked at i’m Spa (an Italian smartwatch startup) for two years, playing with the Android platform and handling their Developer Relations. He’s been toying with the Android SDK since 2010.",
            "name": "Sebastiano Poggi",
            "company": "Novoda",
            "plusoneUrl": "https://plus.google.com/+SebastianoPoggi",
            "website": "",
            "twitter": "https://twitter.com/seebrock3r",
            "thumbnailUrl": "https://lh3.googleusercontent.com/-uhZ-3UFgzzo/T4XR5D4VHiI/AAAAAAABBp4/PNiNGfhEHUs/w354-h352-no/Face_malga.jpg"
        },
        {
            "id": "mathieucalba",
            "bio": "Mathieu is a Mobile Software Developer at Capitaine Train and GDG leader at Lyon with the GDG Lyon Android. Mathieu is fond of new technologies, and particularly with Android. He loves to create applications that integrate seamlessly with the system and spread his love for Android by giving some talks.",
            "name": "Mathieu Calba",
            "company": "Capitaine Train",
            "plusoneUrl": "https://plus.google.com/+MathieuCalba",
            "website": "",
            "twitter": "https://twitter.com/Mathieu_Calba",
            "thumbnailUrl": "https://lh4.googleusercontent.com/-8hq7bSTRUjk/U8-lC8_87tI/AAAAAAAASXI/ZCwhRO7DtvI/s655-no/MathieuCalba_Profile.jpg"
        },
        {
            "id": "pyricau",
            "bio": "Pierre-Yves Ricau is Android Software Engineer at Square, an innovative company that creates sleek, reliable instruments of commerce. He contributes to several open source projects, and created the AndroidAnnotations framework in 2010.",
            "name": "Pierre-Yves Ricau",
            "company": "Square",
            "plusoneUrl": "https://plus.google.com/+PierreYvesRicau",
            "website": "",
            "twitter": "https://twitter.com/Piwai",
            "thumbnailUrl": "http://fr.droidcon.com/2014/wp-content/uploads/2014/07/Pierre-Yves-Ricau-222x222.jpg"
        },
        {
            "id": "nicolasklein",
            "bio": "Nicolas Klein is an engineer working on Google Play Games as well as working on building services to help make it easy to add awesome features to your games.",
            "name": "Nicolas Klein",
            "company": "Google",
            "plusoneUrl": "https://plus.google.com/+NicolasKlein86",
            "website": "http://www.foxykeep.com/homepage/",
            "twitter": "https://twitter.com/foxykeep",
            "thumbnailUrl": "https://lh4.googleusercontent.com/-4sigh6so5Xk/UuqYNIa-AXI/AAAAAAAABGo/UYflVH4bQ2w/w654-h655-no/fox_irl2_centered.png"
        },
        {
            "id": "chprunier",
            "bio": "Charles-Henry is a Development & Design Engineer at Genymobile and he is specialized in ROM customization that are destined for professionals.",
            "name": "Charles-Henry Prunier",
            "company": "Genymobile",
            "plusoneUrl": "https://plus.google.com/113947333441309712266",
            "website": "",
            "twitter": "",
            "thumbnailUrl": "https://lh6.googleusercontent.com/-Xku8jvfCRRY/UvJ84ze_BBI/AAAAAAAAAPg/wW1jyNGkaBw/w656-h655-no/Charly.jpg"
        },
        {
            "id": "remygottschalk",
            "bio": "Rémy is a Development & Design Engineer at Genymobile and he is specialized in ROM customization that are destined for professionals.",
            "name": "Rémy Gottschalk",
            "company": "Genymobile",
            "plusoneUrl": "https://plus.google.com/115906133301850752077",
            "website": "",
            "twitter": "",
            "thumbnailUrl": "http://fr.droidcon.com/2014/wp-content/uploads/2014/07/R%C3%A9my-Gottschak-222x222.jpg"
        },
        {
            "id": "jeanmaisonnial",
            "bio": "Jean has been working at Google for more than 3 years. He is a Mobile Apps Consultant and works with French developers to help them to grow, distribute and monetize their applications.",
            "name": "Jean Maisonnial",
            "company": "Google",
            "plusoneUrl": "https://plus.google.com/102884676049998981590",
            "website": "",
            "twitter": "",
            "thumbnailUrl": "http://fr.droidcon.com/2014/wp-content/uploads/2014/08/Jean-Maisonnial-222x222.jpg"
        },
        {
            "id": "simonstewart",
            "bio": "Often described as a “fire hazard” and sporting more hair than most primates, Simon is a Software Engineer on Facebook's internal tools team. He has best known for having turned his hairy hands to the invention of WebDriver, the open source web application testing tool, as well as leading the Selenium project. When he is not saving kittens from fires, or rescuing Granny’s from micro perms, he enjoys talking incessantly about Facebook's commitment to OSS and how we organize our git repo. Please ask him what makes for a truly pleasurable London bus experience.",
            "name": "Simon Stewart",
            "company": "Facebook",
            "plusoneUrl": "https://plus.google.com/104565969450039850531",
            "website": "",
            "twitter": "https://twitter.com/shs96c",
            "thumbnailUrl": "https://lh6.googleusercontent.com/-N47hWFi5frI/TW9OX3t6YFI/AAAAAAAACh4/FbryZVBQ278/w500-h499-no/headshot.jpeg"
        },
        {
            "id": "amritsanjeev",
            "bio": "Google Developer Expert - Android\nOrganizer of GDG Blrdroid\nIntel Influencer - Android \nWorks at Digital Insight as Mobile Staff Engineer. \nPreviously worked as a Research engineer at Philips and Architect at IBM ",
            "name": "Amrit Sanjeev",
            "company": "Digital Insight",
            "plusoneUrl": "https://plus.google.com/+AmritSanjeev",
            "website": "http://amsanjeev.wordpress.com/",
            "twitter": "https://twitter.com/amsanjeev",
            "thumbnailUrl": "https://lh5.googleusercontent.com/-hsv3-3ocI5c/U3miCl0UcTI/AAAAAAAADrU/6lqih6PX7wk/s348-no/045A1927.JPG"
        },
        {
            "id": "quentinsallat",
            "bio": "Android Developer for more than three years, I'm a huge fan of mobile and web development. I've been blogging for years about .NET, HTML5 and Java development, and I'm now a Professional Android developer.\n\nI'm especially interested in app design, and with more than fifteen apps published under my personal account, Aerilys, I've some things I'd like to share with my fellow developers!",
            "name": "Quentin Sallat",
            "company": "iD.apps",
            "plusoneUrl": "https://plus.google.com/u/0/114162543563319129793",
            "website": "http://blog.aerilys.fr/",
            "twitter": "https://twitter.com/aerilys",
            "thumbnailUrl": "http://fr.droidcon.com/2014/wp-content/uploads/2014/08/Quentin-Sallat-222x222.jpg"
        },
        {
            "id": "luwenhui",
            "bio": "Wenhui Lu has 12 years’ experience in software development on mobile devices. He has been in different positions at Nokia and Microsoft for various projects ranging from product development to research oriented.\n\nCurrently working as a Technology Wizard, Wenhui promotes the developer ecosystem of Microsoft mobile platforms (Nokia X and Windows Phone) by providing developers with technical consultancy, training, evangelism, and other facilities to help them to succeed with Microsoft.",
            "name": "Lu Wenhui",
            "company": "Microsoft",
            "plusoneUrl": "",
            "website": "",
            "twitter": "https://twitter.com/ui_lu",
            "thumbnailUrl": "http://fr.droidcon.com/2014/wp-content/uploads/2014/08/Wenhui-Lu-222x222.png"
        },
        {
            "id": "damienmehers",
            "bio": "Damian is a Senior Software Engineer at Evernote, based out of Geneva, Switzerland.  He created the original Evernote Windows Phone client, and worked on Evernote Food for Android, and is now focused on Evernote and wearable technology, having created Evernote for the Samsung Galaxy Gear, the Pebble Smartwatch, and Android Wear.\n\nPrior to joining Evernote, Damian released an app he’d created in his spare time, which used Evernote’s open API.  Evernote noticed, and he got a call from the CEO asking if he’d join the company to help build Evernote’s next generation of products.  It wasn’t a hard decision.\nHe has founded several successful software product companies, and loves the magic that is programming: turning something imagined into something real.",
            "name": "Damien Mehers",
            "company": "Evernote",
            "plusoneUrl": "https://plus.google.com/+DamianMehers0",
            "website": "http://damianblog.com/",
            "twitter": "https://twitter.com/DamianMehers",
            "thumbnailUrl": "https://lh3.googleusercontent.com/-q6WOniTjhcc/UmMYwC0a_6I/AAAAAAAFFIU/OnvdujXUHd0/w487-h486-no/DamianPortait25%25.JPG"
        },
        {
            "id": "alexdanvy",
            "bio": "Developer Evangelist at Microsoft",
            "name": "Alex Danvy",
            "company": "Microsoft",
            "plusoneUrl": "https://plus.google.com/u/0/107150265059028646442",
            "website": "http://danvy.tv/",
            "twitter": "https://twitter.com/danvy",
            "thumbnailUrl": "https://lh3.googleusercontent.com/-2aSmCUqOIc8/TXNd9hoSjsI/AAAAAAAAAyE/yUzxsbHRPrk/s399-no/Alex.jpg"
        },
        {
            "id": "cedricpointel",
            "bio": "Cédric Pointel est consultant dans l’équipe mobilité chez OCTO Technology depuis 4 ans. Il réalise des applications mobiles principalement sur iOS dans différents secteurs comme la banque, l’assurance, le luxe ou encore les réseaux sociaux . Il effectue également des missions d’accompagnement et de conseil sur les sujets autour de la mobilité, la qualité des développements et l’intégration continue. Intéressé par la robotique et les objets connectés, il s’est naturellement mis à tester les nouveaux terminaux dont les Google Glass depuis le début de l’année.",
            "name": "Cédric Pointel",
            "company": "Octo Technology",
            "plusoneUrl": "https://plus.google.com/113903980522545486925",
            "website": "",
            "twitter": "https://twitter.com/cpointel",
            "thumbnailUrl": ""
        },
        {
            "id": "mathieuhausherr",
            "bio": "Mathieu Hausherr est développeur d’applications mobiles chez Octo Technology. Il réalise des applications iOS et Android. Il croit en l’industrialisation des devs mobiles, aux tests unitaires et à l’intégration continue. Il teste de nouveaux terminaux, de la lunette à la montre connectée.",
            "name": "Mathieu Hausherr",
            "company": "Octo Technology",
            "plusoneUrl": "https://plus.google.com/111393145937875554935",
            "website": "",
            "twitter": "https://twitter.com/mhausherr",
            "thumbnailUrl": "https://lh3.googleusercontent.com/-QqtML0wa6pA/Tqaipgj0lqI/AAAAAAAABWA/MQjejWlP_x8/w905-h902-no/MHA.jpg"
        }
    ],
    "sessions": [
        {
            "id": "__keynote__",
            "description": "Droidcon Paris Keynote Day 1",
            "photoUrl": "http://danvy.tv/wp/wp-content/header-images/header07.jpg",
            "url": "",
            "startTimestamp": "2014-09-22T07:15:00Z",
            "title": "Keynote Day 1",
            "youtubeUrl": "",
            "mainTag": "FLAG_KEYNOTE",
            "endTimestamp": "2014-09-22T07:45:00Z",
            "color": "",
            "hashtag": "keynote",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "auditorium",
            "speakers": [
                "alexdanvy"
            ],
            "tags": [
                "FLAG_KEYNOTE",
                "THEME_EN"
            ]
        },
        {
            "id": "__keynote2__",
            "description": "Droidcon Paris Keynote Day 2",
            "photoUrl": "",
            "url": "",
            "startTimestamp": "2014-09-23T07:00:00Z",
            "title": "Keynote Day 2",
            "youtubeUrl": "",
            "mainTag": "FLAG_KEYNOTE",
            "endTimestamp": "2014-09-23T08:00:00Z",
            "color": "",
            "hashtag": "keynote",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "auditorium",
            "speakers": [],
            "tags": [
                "FLAG_KEYNOTE",
                "THEME_EN"
            ]
        },
        {
            "id": "session_cyril_mottier_1",
            "description": "Cyril will be presenting how Android saves state in general in order to be able to restore an application in the exact same state the process was prior being killed because of a low memory condition or a configuration change. In this talk he will mainly focus on the Parcelable and Parcel objects and how Android uses them to save or restore some important stateful information such as the complete UI state.",
            "photoUrl": "https://lh5.googleusercontent.com/-CMq7fMXIyUA/UcNRnJC7T4I/AAAAAAAAFeY/8qS5ZHd3n0U/w956-h636-no/DSC01326.jpg",
            "url": "http://fr.droidcon.com/2014/agenda/detail?title=Deep+Dive+Into+State+Restoration",
            "startTimestamp": "2014-09-22T07:55:00Z",
            "title": "Deep Dive into State restoration",
            "youtubeUrl": "",
            "mainTag": "TOPIC_DEVELOPMENT",
            "endTimestamp": "2014-09-22T08:35:00Z",
            "color": "",
            "hashtag": "",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "auditorium",
            "speakers": [
                "cyrilmottier"
            ],
            "tags": [
                "TOPIC_DEVELOPMENT",
                "THEME_EN",
                "THEME_INTERMEDIATE"
            ]
        },
        {
            "id": "session_jan_chong_1",
            "description": "In January 2012, nearly all Twitter for Android code was written by three engineers. As of January 2014, Twitter for Android has several dozens unique contributors from over ten different teams. In this talk, Jan will be presenting how Twitter moved to develop at scale from a single team-based development model to a project based development model that welcomes contributions from across the company and highlight some of the challenges that they ran into on the way.",
            "photoUrl": "",
            "url": "http://fr.droidcon.com/2014/agenda/detail?title=Scaling+Android+Development+at+Twitter",
            "startTimestamp": "2014-09-22T07:55:00Z",
            "title": "Scaling Android Development at Twitter",
            "youtubeUrl": "",
            "mainTag": "TOPIC_DEVELOPMENT",
            "endTimestamp": "2014-09-22T08:35:00Z",
            "color": "",
            "hashtag": "",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "leparisien",
            "speakers": [
                "janchong"
            ],
            "tags": [
                "TOPIC_DEVELOPMENT",
                "THEME_EN",
                "THEME_INTERMEDIATE"
            ]
        },
        {
            "id": "session_xavier_hallade_1",
            "description": "The Android SDK is set to use some content displayed on connected screen from Android 4.2 Discover how to display a different content from your application when your Android is connected to a second screen through HDMI/MHL/SlimPort or wireless through Miracast or Chromecast with equipments that allow the screencasting support.",
            "photoUrl": "https://lh5.googleusercontent.com/-h2pUMAG4J5g/UrP7s0TyUcI/AAAAAAAAGtg/KvfI2REynKk/w956-h717-no/IMG_20131219_194826.jpg",
            "url": "http://fr.droidcon.com/2014/agenda/detail?title=Ajouter+le+support+du+multi-%C3%A9cran+dans+une+application+Android",
            "startTimestamp": "2014-09-22T07:55:00Z",
            "title": "Ajouter le support du multi-écran dans une application Android",
            "youtubeUrl": "",
            "mainTag": "TOPIC_DEVELOPMENT",
            "endTimestamp": "2014-09-22T08:35:00Z",
            "color": "",
            "hashtag": "",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "salon",
            "speakers": [
                "xavierhallade"
            ],
            "tags": [
                "TOPIC_DEVELOPMENT",
                "THEME_FR",
                "THEME_BEGINNER"
            ]
        },
        {
            "id": "session_taylorling_1",
            "description": "There are an increasing number of apps that come with great design nowadays, and most of the carefully crafted apps resonate with the Android users due to their great and consistent User Experience (UX) design. Many developers and designers try hard to create an app with great UX by largely referring to the Android Design Guideline, however, to make remarkable UX design is certainly more than that, and often they missed certain important items from their check list. If you want to check if your app(s) is heading the right direction to awesomeness, be sure to check out this ‘advanced’ check list in making awesome Android apps.",
            "photoUrl": "https://lh3.googleusercontent.com/-27sA4D_8yqs/UmqK6Mrg6eI/AAAAAAAAfc4/2FPmQd-79Hk/w3264-h2448/IMG_20131025_161402.jpg",
            "url": "http://fr.droidcon.com/2014/agenda/detail?title=Ingredients+of+Awesome+App",
            "startTimestamp": "2014-09-22T08:35:00Z",
            "title": "Ingredients for an Awesome App",
            "youtubeUrl": "",
            "mainTag": "TOPIC_UI_UX",
            "endTimestamp": "2014-09-22T09:25:00Z",
            "color": "",
            "hashtag": "",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "auditorium",
            "speakers": [
                "taylorling"
            ],
            "tags": [
                "TOPIC_UI_UX",
                "THEME_EN",
                "THEME_BEGINNER"
            ]
        },
        {
            "id": "session_stephanenicolas_1",
            "description": "During the last few years, we have all assisted or participated to a small revolution on Android: annotation processing. Most libs now rely on annotation processing during build to pre-compute a lot of stuff that will boost them at runtime. Let’s think about Dagger, ButerKnife, Hugo, RoboGuice, BoundBox, Memento, IcePick etc.\n\nNevertheless, writing an annotation processor is far from obvious as it offers an API that is very difficult to understand. The main idea of this session is to suggest an alternative technology (or a complement in some cases): post-compilation processing and byte code manipulation.\n\nThis session is an in-depth review of byte code manipulation in Java and its limitations on Android. Stéphane will also explore a few techniques and librairies that make it simple to write a post compiler byte code processor, with gradle and maven examples. He will be presenting two librairies during his session: AfterBurner and Mimic.\n\nSee how to eliminate all boiler plate from your favorite librairies and boost your applications.",
            "photoUrl": "",
            "url": "http://fr.droidcon.com/2014/agenda/detail?title=Byte+code+manipulation+for+Android+",
            "startTimestamp": "2014-09-22T08:35:00Z",
            "title": "Byte code manipulation for Android",
            "youtubeUrl": "",
            "mainTag": "TOPIC_DEVELOPMENT",
            "endTimestamp": "2014-09-22T09:25:00Z",
            "color": "",
            "hashtag": "",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "salon",
            "speakers": [
                "stephanenicolas"
            ],
            "tags": [
                "TOPIC_DEVELOPMENT",
                "THEME_EN",
                "THEME_EXPERT"
            ]
        },
        {
            "id": "session_fabiendevos_1",
            "description": "A lot have ideas but only few realize their potential. In this talk, Fabien will present how to develop an application within four months from start to launch.\n\nThis session won’t be about RSS feed or another Flappy bird. It will tackle complex issues involving not only UI but also development and strategy.  These are few questions that will be raised during the session:\n\n- How can you choose and confirm an idea?\n\n- How can you make an UI intuitive ?\n\n- How can you tackle and solve complex development issues ?\n\n- How can you set and reach goals?",
            "photoUrl": "https://lh3.googleusercontent.com/-IZAlWCdh0IM/UcDK6v6hvSI/AAAAAAAAFCY/oyf_5oLW4gg/w783-h440-no/20130618_112256.jpg",
            "url": "http://fr.droidcon.com/2014/agenda/detail?title=The+making+of+an+app%3A+from+having+an+idea+to+shipping+it",
            "startTimestamp": "2014-09-22T09:55:00Z",
            "title": "The making of an app: from having an idea to shipping it",
            "youtubeUrl": "",
            "mainTag": "TOPIC_OTHER",
            "endTimestamp": "2014-09-22T10:45:00Z",
            "color": "",
            "hashtag": "",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "auditorium",
            "speakers": [
                "fabiendevos"
            ],
            "tags": [
                "TOPIC_OTHER",
                "THEME_EN",
                "THEME_INTERMEDIATE"
            ]
        },
        {
            "id": "session_nabilhachicha_1",
            "description": "Gradle is becoming more & more adopted by developers as their main build system especially after the release of Android Studio. Thanks to the plugins architecture, Gradle allows users to reuse patterns and practices, avoiding boilerplate build code.\n\nIn this session, Nabil will be focusing on creating a Plugin that cooperates with the existing “android plugin”, in order to demonstrate some key concepts like: tasks, lifecycle, defining a custom DSL, incremental build and testing…",
            "photoUrl": "https://lh6.googleusercontent.com/-br4iTdrftuk/Uq4kerLpQnI/AAAAAAAABUQ/4GJz5m4JdfY/w2048-h1365/_MG_4762.jpg",
            "url": "http://fr.droidcon.com/2014/agenda/detail?title=Android+tools%3A+Create+your+custom+Gradle+plugin",
            "startTimestamp": "2014-09-22T09:55:00Z",
            "title": "Android Tools: create your custom Gradle plugin",
            "youtubeUrl": "",
            "mainTag": "TOPIC_DEVELOPMENT",
            "endTimestamp": "2014-09-22T10:45:00Z",
            "color": "",
            "hashtag": "",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "leparisien",
            "speakers": [
                "nabilhachicha"
            ],
            "tags": [
                "TOPIC_DEVELOPMENT",
                "THEME_EN",
                "THEME_INTERMEDIATE"
            ]
        },
        {
            "id": "session_guillaumelaforge_1",
            "description": "For the past 10 years, Groovy has vastly improved the productivity of Java developers. With its unique features, like closures, builders, code transformations, traits, static compilation and many others, Groovy has become a very competitive language on the JVM platform. Compared to other alternative JVM languages, Groovy has the advantage of offering the best interoperability story with Java, while still keeping a concise syntax familiar to Java developers.\nWhat about the mobile story? In particular, with Android, developers basically only hava Java as sole choice.\nCouldn’t they too benefit from advantages provided by Groovy?\nCan’t we make Android developers life less painful too?\nIn this session, Guillaume will show how you can use Groovy to develop Android applications, bringing all the productivity and modernity Groovy provides on the Android platform.\nHe will also explain the potential issues you might be encountering, but if you are jealous of your iOS friends with Swift, get your smile back, Groovy is there for you!",
            "photoUrl": "http://blog.smartbear.com/wp-content/uploads/imports/guillaume_laforge.jpg",
            "url": "http://fr.droidcon.com/2014/agenda/detail?title=Groovy+sur+Android",
            "startTimestamp": "2014-09-22T09:55:00Z",
            "title": "Groovy sur Android",
            "youtubeUrl": "",
            "mainTag": "TOPIC_DEVELOPMENT",
            "endTimestamp": "2014-09-22T10:45:00Z",
            "color": "",
            "hashtag": "",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "leparisien",
            "speakers": [
                "guillaumelaforge"
            ],
            "tags": [
                "TOPIC_DEVELOPMENT",
                "THEME_FR",
                "THEME_BEGINNER"
            ]
        },
        {
            "id": "session_geoffreydorne_1",
            "description": "How is design useful in our lives? Design is used not only to make things beautiful but also to promote innovation and improvement in humain beings individually, collectively and collaboratively. Using examples and key elements, Geoffrey invites you to discover how the creation of services, products, objects and experiences may change our lives.",
            "photoUrl": "",
            "url": "http://fr.droidcon.com/2014/agenda/detail?title=Petit+design+pour+grande+humanit%C3%A9",
            "startTimestamp": "2014-09-23T08:15:00Z",
            "title": "Petit design pour grande Humanité",
            "youtubeUrl": "",
            "mainTag": "TOPIC_OTHER",
            "endTimestamp": "2014-09-23T09:05:00Z",
            "color": "",
            "hashtag": "",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "leparisien",
            "speakers": [
                "geoffreydorne"
            ],
            "tags": [
                "TOPIC_OTHER",
                "THEME_FR",
                "THEME_BEGINNER"
            ]
        },
        {
            "id": "session_marcdecourville_1",
            "description": "Archos has just launched a full connected home solution based on a Android tablet and relying on Bluetooth Low Energy accessories. The purpose of the talk:\n\n- how Android can play a major role in the connected home revolution\n\n- the overall system architecture based on Android BLE, Google Cloud Messaging, Google Apps Engine, STUN/ICE remote connection\n\n- the strategy to open up the Archos applications and accessories.",
            "photoUrl": "https://lh6.googleusercontent.com/-E1Gd-d7h-ZY/TrvyAFJcTTI/AAAAAAAAAFk/udyRHHP4uac/w956-h717-no/2011-10-26%2B20.49.50.jpg",
            "url": "http://fr.droidcon.com/2014/agenda/detail?title=Archos+Android+based+connected+home+solution",
            "startTimestamp": "2014-09-23T08:15:00Z",
            "title": "Archos Android based connected home solutions",
            "youtubeUrl": "",
            "mainTag": "TOPIC_EVERYWHERE",
            "endTimestamp": "2014-09-23T09:05:00Z",
            "color": "",
            "hashtag": "",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "auditorium",
            "speakers": [
                "marcdecourville"
            ],
            "tags": [
                "TOPIC_EVERYWHERE",
                "THEME_EN",
                "THEME_INTERMEDIATE"
            ]
        },
        {
            "id": "session_jbkempf_1",
            "description": "VLC is a free and open source cross-platform multimedia player and framework that plays most multimedia files, discs and streams. VLC runs on most platforms and is developed by volunteers.\n\nThis talk will explain how we ported VLC to Android using the NDK, the issues we faced and how we solved most of them. It will also detail the future of VLC on the Android platform.",
            "photoUrl": "http://www.namac.org/sites/default/files/Baptiste.jpg",
            "url": "http://fr.droidcon.com/2014/agenda/detail?title=Porting+VLC+on+Android",
            "startTimestamp": "2014-09-23T09:35:00Z",
            "title": "Porting VLC on Android",
            "youtubeUrl": "",
            "mainTag": "TOPIC_DEVELOPMENT",
            "endTimestamp": "2014-09-23T10:25:00Z",
            "color": "",
            "hashtag": "",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "salon",
            "speakers": [
                "jbkempf"
            ],
            "tags": [
                "TOPIC_DEVELOPMENT",
                "THEME_EN",
                "THEME_INTERMEDIATE"
            ]
        },
        {
            "id": "session_timmesserschmidt_1",
            "description": "User authentication in mobile applications is a very common and integral use case. Implementing regular passwords is an easy solution for developers but comes with several pitfalls that impair user experience like (re-)entering passwords, the need to create a new unique password or even just the input of personal data on a flaky keyboard while registering a new account.\n\nIn this talk the security flaws and UX implications of passwords will be discussed and highlighted which different techniques exist that are able to offer a more mobile friendly flow. Highlighting authorization and authentication techniques like OAuth, OpenID Connect and even hardware features like Bluetooth Low Energy. This talk will be interesting for anyone who’s facing a situation where creating and storing user accounts matters.",
            "photoUrl": "https://lh5.googleusercontent.com/-Xa8nBAMVABI/Uk8f8FVQ5lI/AAAAAAAAPZQ/mMxV4UqCTlQ/w956-h637/plus.jpg",
            "url": "http://fr.droidcon.com/2014/agenda/detail?title=Death+to+Passwords",
            "startTimestamp": "2014-09-23T09:35:00Z",
            "title": "Death to Passwords",
            "youtubeUrl": "",
            "mainTag": "TOPIC_UI_UX",
            "endTimestamp": "2014-09-23T10:25:00Z",
            "color": "",
            "hashtag": "",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "leparisien",
            "speakers": [
                "timmesserschmidt"
            ],
            "tags": [
                "TOPIC_UI_UX",
                "THEME_EN",
                "THEME_BEGINNER"
            ]
        },
        {
            "id": "session_hoilam_1",
            "description": "Outline the key considerations while designing and building for Android Wear. In addition, Hoi will talk about some of the lessons learnt from experiences and give developer an opportunity to ask questions.",
            "photoUrl": "",
            "url": "http://fr.droidcon.com/2014/agenda/detail?title=Android+Wear",
            "startTimestamp": "2014-09-23T09:35:00Z",
            "title": "Android Wear",
            "youtubeUrl": "",
            "mainTag": "TOPIC_EVERYWHERE",
            "endTimestamp": "2014-09-23T10:25:00Z",
            "color": "",
            "hashtag": "",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "auditorium",
            "speakers": [
                "hoilam"
            ],
            "tags": [
                "TOPIC_EVERYWHERE",
                "THEME_EN",
                "THEME_BEGINNER"
            ]
        },
        {
            "id": "session_marioviviani_1",
            "description": "With the addition of Android Wear to the Android ecosystem, the “wearables era” is officially opened. Android apps can now extend beyond the limits of smartphone and tablets, providing to the user a new kind of interaction where “less is more” and opening new ways for developers to engage users within their apps.\n\nHowever, the approach to Wear development is slightly different from handheld Android coding, and different are also the types of applications developers can design, develop and distribute for Wear devices.\n\nIn this talk, Mario will be presenting how to easily setup and include Android Wear features within your Android App in just a few minutes, an overview of Android Studio tools for Wear development, what are the best practices of Wear APIs you should keep in mind and what are the main difference between “classic” Android handheld development and Wear.",
            "photoUrl": "http://www.androidiani.com/wp-content/uploads/2014/01/TAG-Evento-473x355.jpg",
            "url": "http://fr.droidcon.com/2014/agenda/detail?title=Kick-start+your+experience+with+Android+Wear",
            "startTimestamp": "2014-09-23T10:25:00Z",
            "title": "Kick-start your experience with Android Wear",
            "youtubeUrl": "",
            "mainTag": "TOPIC_EVERYWHERE",
            "endTimestamp": "2014-09-23T11:15:00Z",
            "color": "",
            "hashtag": "",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "auditorium",
            "speakers": [
                "marioviviani"
            ],
            "tags": [
                "TOPIC_EVERYWHERE",
                "THEME_EN",
                "THEME_INTERMEDIATE"
            ]
        },
        {
            "id": "session_cedriccreusot_jeanloupyu_1",
            "description": "Mobile is becoming slowly but surely the future of our habits. European Leader of Dating website, Meetic is a pioneer in the French Web which is deeply transforming to adapt to new functions. One of the main painful issues that you can meet before releasing an app: is it ready to be released? Did we break a feature while building this new version? In short, do we have the right to launch the application ?\n\nThis is for this reason and their wish to tackle this painful issue that thet have worked on automatical functional tests for mobile applications and the tool Calaba.sh in particular. Why and how can we write high level automatical tests? What executive strategy can we opt for?\n\nIn this talk, Cédric and Jean-Loup will be answering these questions. They will give feedback on their experience and will show you how they integrated this tool to their development cycle.",
            "photoUrl": "",
            "url": "http://fr.droidcon.com/2014/agenda/detail?title=Feu+vert+pour+les+apps+avec+Calaba.sh+%21",
            "startTimestamp": "2014-09-23T10:25:00Z",
            "title": "Feu vert pour les apps avec Calaba.sh !",
            "youtubeUrl": "",
            "mainTag": "TOPIC_DEVELOPMENT",
            "endTimestamp": "2014-09-23T11:15:00Z",
            "color": "",
            "hashtag": "",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "leparisien",
            "speakers": [
                "cedriccreusot",
                "jeanloupyu"
            ],
            "tags": [
                "TOPIC_DEVELOPMENT",
                "THEME_EN",
                "THEME_INTERMEDIATE"
            ]
        },
        {
            "id": "session_benjaminaugustin_1",
            "description": "Ever had to deal with a terribly designed API or spent hours re-factoring your code to deal with an updated API? You have also hard about RxJava but can’t see how it could benefit your project? In his talk, Benjamin will take the practical approach of a complex API to explain how RxJava and Functional Reactive Programming (FRP) can be used on every projects to make your life easier.",
            "photoUrl": "",
            "url": "http://fr.droidcon.com/2014/agenda/detail?title=Rx-Fy+all+the+things%21",
            "startTimestamp": "2014-09-23T10:25:00Z",
            "title": "Rx-Fy all the things!",
            "youtubeUrl": "",
            "mainTag": "TOPIC_DEVELOPMENT",
            "endTimestamp": "2014-09-23T11:15:00Z",
            "color": "",
            "hashtag": "",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "salon",
            "speakers": [
                "benjaminaugustin"
            ],
            "tags": [
                "TOPIC_DEVELOPMENT",
                "THEME_EN",
                "THEME_EXPERT"
            ]
        },
        {
            "id": "session_thomasguerin_1",
            "description": "Ladies and gentlemen, get prepared. In the red corner, with a 104KB – weight, the most popular among all Test Frameworks: Robotium. In the blue corner, with a 262KB-weight and supporting by Google Teams, there is the one qualified by “new comer”: Espresso. Let’s the battle start!!\n\nThomas will be presenting, with code, how the latter works, the pros and cons. Plus, he will talk about Calabash Android and UI Automator.",
            "photoUrl": "https://pbs.twimg.com/media/BlWvZFhCYAA9-ft.jpg:large",
            "url": "http://fr.droidcon.com/2014/agenda/detail?title=Robotium+vs+Espresso%3A+Get+ready+to+rumble+%21",
            "startTimestamp": "2014-09-23T12:15:00Z",
            "title": "Robotium vs Espresso: Get ready to rumble !",
            "youtubeUrl": "",
            "mainTag": "TOPIC_DEVELOPMENT",
            "endTimestamp": "2014-09-23T13:05:00Z",
            "color": "",
            "hashtag": "",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "salon",
            "speakers": [
                "thomasguerin"
            ],
            "tags": [
                "TOPIC_DEVELOPMENT",
                "THEME_FR",
                "THEME_INTERMEDIATE"
            ]
        },
        {
            "id": "session_sebastianopoggi_1",
            "description": "In his talk, Sebastiano will guide you through a topic that is often ignored: the Canvas API. Even if there’s only scarce documentation for it, the Canvas API is at the heart of everything that shows a UI on Android. You’ll need to tame this powerful and mysterious creature if you want to create great custom views and brilliant, lightweight UIs for your apps.\n\nWhat is a Canvas? How do you Paint? Can you draw Paths? What is Skia, and who invited it anyway? What actually happens during a drawing pass? What are Shaders? What are Filters? Is it true that text is basically impossible to measure correctly? What shape does a Shape have if noone’s painting it? These are some of the questions which will be answered during the session.\n\nConnect the dots in the spotty documentation the Android team has assembled, and become a true pixel pusher!",
            "photoUrl": "https://lh6.googleusercontent.com/-ttdqnrv8Ytw/UcIcQYqzYzI/AAAAAAAAGWw/oyiPR0KayuI/w783-h440-no/20130618_181340.jpg",
            "url": "http://fr.droidcon.com/2014/agenda/detail?title=Framing+the+Canvas",
            "startTimestamp": "2014-09-23T12:15:00Z",
            "title": "Framing the Canvas",
            "youtubeUrl": "",
            "mainTag": "TOPIC_UI_UX",
            "endTimestamp": "2014-09-23T13:05:00Z",
            "color": "",
            "hashtag": "",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "auditorium",
            "speakers": [
                "sebastianopoggi"
            ],
            "tags": [
                "TOPIC_UI_UX",
                "THEME_EN",
                "THEME_INTERMEDIATE"
            ]
        },
        {
            "id": "session_mathieucalba_1",
            "description": "Almost every mobile application needs to synchronise data with a server, on Android too. Nonetheless their are many ways to do it : Alert Managers & Services or SyncAdapter  … and each ones has its pros & cons. Recently Google added a new way to do asynchronous work on Android in the L preview release : JobScheduler.\n\nIn his talk, Mathieu will be presenting how each technique works and how they have done it in the Capitaine Train Android application for a feedback with a complex data model.",
            "photoUrl": "https://lh3.googleusercontent.com/-U8KcFiwcGPI/Ub-S3Qeb68I/AAAAAAAAEHs/-DbWM02-38w/w783-h440-no/20130617_163828.jpg",
            "url": "http://fr.droidcon.com/2014/agenda/detail?title=The+Death+of+the+Refresh+Button",
            "startTimestamp": "2014-09-23T12:15:00Z",
            "title": "The Death of the Refresh Button",
            "youtubeUrl": "",
            "mainTag": "TOPIC_DEVELOPMENT",
            "endTimestamp": "2014-09-23T13:05:00Z",
            "color": "",
            "hashtag": "",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "leparisien",
            "speakers": [
                "mathieucalba"
            ],
            "tags": [
                "TOPIC_DEVELOPMENT",
                "THEME_EN",
                "THEME_INTERMEDIATE"
            ]
        },
        {
            "id": "session_pyricau_1",
            "description": "At Droidcon Paris, Pierre-Yves will be talking about how to remove Fragments from your appplications by splitting the logic into reusable Views and Presenters, with the help of the Mortar Library.",
            "photoUrl": "https://lh3.googleusercontent.com/-EPm72rfCtqE/UkHvwNNYrwI/AAAAAAAAHZg/UnVbtXVECgs/w956-h538-no/20130920_193942.JPG",
            "url": "http://fr.droidcon.com/2014/agenda/detail?title=D%C3%A9fragmentez+vos+apps+avec+Mortar+%21",
            "startTimestamp": "2014-09-23T13:05:00Z",
            "title": "Défragmentez vos apps avec Mortar !",
            "youtubeUrl": "",
            "mainTag": "TOPIC_DEVELOPMENT",
            "endTimestamp": "2014-09-23T13:55:00Z",
            "color": "",
            "hashtag": "",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "auditorium",
            "speakers": [
                "pyricau"
            ],
            "tags": [
                "TOPIC_DEVELOPMENT",
                "THEME_EN",
                "THEME_INTERMEDIATE"
            ]
        },
        {
            "id": "session_nicolasklein_1",
            "description": "",
            "photoUrl": "",
            "url": "http://fr.droidcon.com/2014/agenda/detail?title=A+Quest+for+Engaged%2C+Happy+Players%3A+Google+Play+Game+Services+Year+2",
            "startTimestamp": "2014-09-23T13:05:00Z",
            "title": "A Quest for Engaged, Happy Players: Google Play Game Services Year 2",
            "youtubeUrl": "",
            "mainTag": "TOPIC_DEVELOPMENT",
            "endTimestamp": "2014-09-23T13:55:00Z",
            "color": "",
            "hashtag": "",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "salon",
            "speakers": [
                "nicolasklein"
            ],
            "tags": [
                "TOPIC_DEVELOPMENT",
                "THEME_FR",
                "THEME_INTERMEDIATE"
            ]
        },
        {
            "id": "session_chprunier_remygottschalk_1",
            "description": "This session is about the android build system, especially its makefiles and how to use them well. Both Rémy and Charles-Henry will be giving this talk.",
            "photoUrl": "https://lh6.googleusercontent.com/-ybpGl7DV12M/U2-5uwyMJrI/AAAAAAAAH4M/i1CDu45aK-c/w956-h637-no/IMG_5888.jpg",
            "url": "http://fr.droidcon.com/2014/agenda/detail?title=buildsystem.mk",
            "startTimestamp": "2014-09-23T15:15:00Z",
            "title": "buildsystem.mk",
            "youtubeUrl": "",
            "mainTag": "TOPIC_EVERYWHERE",
            "endTimestamp": "2014-09-23T16:00:00Z",
            "color": "",
            "hashtag": "",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "salon",
            "speakers": [
                "chprunier",
                "remygottschalk"
            ],
            "tags": [
                "TOPIC_EVERYWHERE",
                "THEME_FR",
                "THEME_EXPERT"
            ]
        },
        {
            "id": "session_jeanmaisonnial_1",
            "description": "Every day, more than 2,5k applications are added to app stores globally. Less than 50% of these will become sustainable businesses. To turn mobile apps into a business, a successful revenue strategy is essential.\nIn this session, Jean will cover:\n- Mobile app monetization models and industry trends.\n- Valuable users and how to identify them\n- Driving engagement and focusing on the long term value of users\n- Monetizing your audience using different revenue channels.",
            "photoUrl": "",
            "url": "http://fr.droidcon.com/2014/agenda/detail?title=Maximize+App+engagement+and+monetization",
            "startTimestamp": "2014-09-23T13:55:00Z",
            "title": "Maximize App engagement and monetization",
            "youtubeUrl": "",
            "mainTag": "TOPIC_EVERYWHERE",
            "endTimestamp": "2014-09-23T14:45:00Z",
            "color": "",
            "hashtag": "",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "leparisien",
            "speakers": [
                "jeanmaisonnial"
            ],
            "tags": [
                "TOPIC_EVERYWHERE",
                "THEME_EN",
                "THEME_BEGINNER"
            ]
        },
        {
            "id": "session_simonstewart_1",
            "description": "There are hundreds of software engineers working on Facebook’s Android application. The codebase is large, and the pace of change is unrelenting. Despite the complexity of size and rapid development, a new alpha release that’s known to be solid is shipped three times a week. We’d not be able to go this fast, or scale our development team this effectively, without using large amounts of OSS.\n\nIn this talk, I’ll discuss the Open Source tools that help us build Facebook for Android, how we contribute technology to OSS, and how we do our best to be good citizens in the broader OSS world. I’ll do this by looking at the full life cycle of a release, going from how we organize our source, do code reviews in phabricator, through building using tools such as Buck, to how we’ve improved the quality of our releases using OSS testing tools such as Selendroid.",
            "photoUrl": "https://i.ytimg.com/vi/5o6Rb8W9_Do/maxresdefault.jpg",
            "url": "http://fr.droidcon.com/2014/agenda/detail?title=How+Open+Source+Powers+Facebook+on+Android",
            "startTimestamp": "2014-09-22T08:35:00Z",
            "title": "How Open Source Powers Facebook on Android",
            "youtubeUrl": "",
            "mainTag": "TOPIC_EVERYWHERE",
            "endTimestamp": "2014-09-22T09:25:00Z",
            "color": "",
            "hashtag": "",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "leparisien",
            "speakers": [
                "simonstewart"
            ],
            "tags": [
                "TOPIC_EVERYWHERE",
                "THEME_EN",
                "THEME_INTERMEDIATE"
            ]
        },
        {
            "id": "session_amrit_sanjeev_1",
            "description": "Talk will do a deep dive into the following \n- general architecture of event bus\n- when, how and why to use event bus\n- advantages and disadvantages of using it\n- comparison of different event bus libraries and features",
            "photoUrl": "https://lh5.googleusercontent.com/-VBGIXC3BUXo/UsaCSuP135I/AAAAAAAABds/YpDDYsUV9Z8/w877-h655-no/IMG_20140103_145231.jpg",
            "url": "http://fr.droidcon.com/2014/agenda/detail?title=Architecting+applications+using+Event+Bus+",
            "startTimestamp": "2014-09-23T13:55:00Z",
            "title": "Architecting applications using Event Bus ",
            "youtubeUrl": "",
            "mainTag": "TOPIC_DEVELOPMENT",
            "endTimestamp": "2014-09-23T14:45:00Z",
            "color": "",
            "hashtag": "",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "auditorium",
            "speakers": [
                "amritsanjeev"
            ],
            "tags": [
                "TOPIC_DEVELOPMENT",
                "THEME_EN",
                "THEME_INTERMEDIATE"
            ]
        },
        {
            "id": "session_quentin_sallat_1",
            "description": "Avec l'arrivée d'Android L, Google a décidé d'apporter à son OS mobile un nouvel ensemble de règles visuelles nommé Material Design. Mais il n'est pour autant pas nécessaire de changer intégralement le design de son application pour respecter ces nouvelles guidelines. \n\nCette conférence vous montrera en direct comment passer de Holo à Material au travers d'une application. Du floating button aux cartes à la Google Now, en passant par les nouvelles APIs d'animation, vous saurez tout ce qui est nécessaire pour effectuer une transition en douceur.",
            "photoUrl": "",
            "url": "http://fr.droidcon.com/2014/agenda/detail?title=Holo+Material+Design+Transition",
            "startTimestamp": "2014-09-23T13:55:00Z",
            "title": "Holo -> Material Design\ntransition",
            "youtubeUrl": "",
            "mainTag": "TOPIC_UI_UX",
            "endTimestamp": "2014-09-23T14:45:00Z",
            "color": "",
            "hashtag": "",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "salon",
            "speakers": [
                "quentinsallat"
            ],
            "tags": [
                "TOPIC_UI_UX",
                "THEME_FR",
                "THEME_BEGINNER"
            ]
        },
        {
            "id": "session_octo",
            "description": "Vous êtes prèts à réaliser votre première application Google Glass ? Vous vous posez les mêmes que questions que nous nous sommes posées sur toutes nos applications :\n\n• Comment faire de l'authentification sur un device sans clavier ? \n• Comment scanner ou reconnaitre un objet en le regardant ?\n• Comment proposer une navigation intuitive et dynamique ?\n• Comment échanger avec votre SI et partager du contenu avec d'autres utilisateurs ?\n\nNous vous montrerons les différentes dépendances à ajouter dans votre build.gradle afin de combler les rêves les plus fous de vos utilisateurs en leur offrant une application adaptée aux lunettes connectées.\n\nVous n'êtes pas encore près ? Pas de panique, vous repartirez avec assez d'idées pour vous convaincre d'acheter des Glass. Et vous découvrirez, grâce à notre code, qu'une application Google Glass ce n'est finalement qu'une simple application Android.",
            "photoUrl": "",
            "url": "http://fr.droidcon.com/2014/agenda/detail?title=Google+Glass%2C+quels+Frameworks+pour+quels+usages%3F",
            "startTimestamp": "2014-09-23T15:15:00Z",
            "title": "Google Glass, quels Frameworks pour quels usages?",
            "youtubeUrl": "",
            "mainTag": "TOPIC_EVERYWHERE",
            "endTimestamp": "2014-09-23T16:00:00Z",
            "color": "",
            "hashtag": "",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "leparisien",
            "speakers": [
                "cedricpointel",
                "mathieuhausherr"
            ],
            "tags": [
                "TOPIC_EVERYWHERE",
                "THEME_FR",
                "THEME_INTERMEDIATE"
            ]
        },
        {
            "id": "session_damian_mehers",
            "description": "Come to this session for a walk-though of real world app architecture on Android Wear. See what’s involved in creating a production-level wearable app, including code and debug walkthroughs, and concrete suggestions for new Android Wear developers.\n\nHaving developed Evernote for the Samsung Galaxy Gear, the Pebble and Android Wear, Damian Mehers has experience not only developing for wearables, but also thinking about what user-experience makes sense for wearables.",
            "photoUrl": "",
            "url": "http://fr.droidcon.com/2014/agenda/detail?title=Extending+your+app+to+your+wrist%3A+lessons+from+the+front",
            "startTimestamp": "2014-09-23T15:15:00Z",
            "title": "Extending your app to your wrist: lessons from the front",
            "youtubeUrl": "",
            "mainTag": "TOPIC_EVERYWHERE",
            "endTimestamp": "2014-09-23T16:00:00Z",
            "color": "",
            "hashtag": "",
            "isLivestream": false,
            "captionsUrl": "",
            "room": "auditorium",
            "speakers": [
                "damienmehers"
            ],
            "tags": [
                "TOPIC_EVERYWHERE",
                "THEME_EN",
                "THEME_BEGINNER"
            ]
        }
    ],
    "blocks": [
        {
            "start": "2014-09-22T06:30:00.000Z",
            "end": "2014-09-22T07:15:00.000Z",
            "title": "Welcome & Breakfast",
            "type": "break",
            "subtitle": "Main Hall, Level 1"
        },
        {
            "start": "2014-09-22T07:15:00.000Z",
            "end": "2014-09-22T07:45:00.000Z",
            "title": "",
            "type": "free",
            "subtitle": ""
        },
        {
            "start": "2014-09-22T07:55:00.000Z",
            "end": "2014-09-22T08:35:00.000Z",
            "title": "",
            "type": "free",
            "subtitle": ""
        },
        {
            "start": "2014-09-22T08:35:00.000Z",
            "end": "2014-09-22T09:25:00.000Z",
            "title": "",
            "type": "free",
            "subtitle": ""
        },
        {
            "start": "2014-09-22T09:25:00.000Z",
            "end": "2014-09-22T09:55:00.000Z",
            "title": "Break",
            "type": "break",
            "subtitle": ""
        },
        {
            "start": "2014-09-22T09:55:00.000Z",
            "end": "2014-09-22T10:45:00.000Z",
            "title": "",
            "type": "free",
            "subtitle": ""
        },
        {
            "start": "2014-09-22T10:45:00.000Z",
            "end": "2014-09-22T11:05:00.000Z",
            "title": "Barcamp start",
            "type": "break",
            "subtitle": "Auditorium"
        },
        {
            "start": "2014-09-22T11:05:00.000Z",
            "end": "2014-09-22T12:20:00.000Z",
            "title": "Lunch",
            "type": "break",
            "subtitle": "Main Hall, Level 1"
        },
        {
            "start": "2014-09-22T11:20:00.000Z",
            "end": "2014-09-22T12:20:00.000Z",
            "title": "",
            "type": "free",
            "subtitle": ""
        },
        {
            "start": "2014-09-22T12:20:00.000Z",
            "end": "2014-09-22T12:50:00.000Z",
            "title": "Barcamp session",
            "type": "break",
            "subtitle": ""
        },
        {
            "start": "2014-09-22T12:50:00.000Z",
            "end": "2014-09-22T13:20:00.000Z",
            "title": "Barcamp session",
            "type": "break",
            "subtitle": ""
        },
        {
            "start": "2014-09-22T13:20:00.000Z",
            "end": "2014-09-22T13:50:00.000Z",
            "title": "Barcamp session",
            "type": "break",
            "subtitle": ""
        },
        {
            "start": "2014-09-22T13:50:00.000Z",
            "end": "2014-09-22T14:20:00.000Z",
            "title": "Barcamp session",
            "type": "break",
            "subtitle": ""
        },
        {
            "start": "2014-09-22T14:20:00.000Z",
            "end": "2014-09-22T14:50:00.000Z",
            "title": "Barcamp session",
            "type": "break",
            "subtitle": ""
        },
        {
            "start": "2014-09-22T14:50:00.000Z",
            "end": "2014-09-22T15:20:00.000Z",
            "title": "Barcamp session",
            "type": "break",
            "subtitle": ""
        },
        {
            "start": "2014-09-22T15:30:00.000Z",
            "end": "2014-09-22T16:30:00.000Z",
            "title": "Barcamp session",
            "type": "break",
            "subtitle": ""
        },
        {
            "start": "2014-09-22T17:00:00.000Z",
            "end": "2014-09-22T22:00:00.000Z",
            "title": "Party",
            "type": "break",
            "subtitle": "La Petite Louise"
        },
        {
            "start": "2014-09-23T06:30:00.000Z",
            "end": "2014-09-23T07:00:00.000Z",
            "title": "Welcome & Breakfast",
            "type": "break",
            "subtitle": "Main Hall, Level 1"
        },
        {
            "start": "2014-09-23T07:00:00.000Z",
            "end": "2014-09-23T08:00:00.000Z",
            "title": "",
            "type": "free",
            "subtitle": ""
        },
        {
            "start": "2014-09-23T08:00:00.000Z",
            "end": "2014-09-23T08:15:00.000Z",
            "title": "",
            "type": "free",
            "subtitle": ""
        },
        {
            "start": "2014-09-23T08:15:00.000Z",
            "end": "2014-09-23T09:05:00.000Z",
            "title": "",
            "type": "free",
            "subtitle": ""
        },
        {
            "start": "2014-09-23T09:05:00.000Z",
            "end": "2014-09-23T09:35:00.000Z",
            "title": "Break",
            "type": "break",
            "subtitle": ""
        },
        {
            "start": "2014-09-23T09:35:00.000Z",
            "end": "2014-09-23T10:25:00.000Z",
            "title": "",
            "type": "free",
            "subtitle": ""
        },
        {
            "start": "2014-09-23T10:25:00.000Z",
            "end": "2014-09-23T11:15:00.000Z",
            "title": "",
            "type": "free",
            "subtitle": ""
        },
        {
            "start": "2014-09-23T11:15:00.000Z",
            "end": "2014-09-23T12:15:00.000Z",
            "title": "Lunch",
            "type": "break",
            "subtitle": ""
        },
        {
            "start": "2014-09-23T12:15:00.000Z",
            "end": "2014-09-23T13:05:00.000Z",
            "title": "",
            "type": "free",
            "subtitle": ""
        },
        {
            "start": "2014-09-23T13:05:00.000Z",
            "end": "2014-09-23T13:55:00.000Z",
            "title": "",
            "type": "free",
            "subtitle": ""
        },
        {
            "start": "2014-09-23T13:55:00.000Z",
            "end": "2014-09-23T14:45:00.000Z",
            "title": "",
            "type": "free",
            "subtitle": ""
        },
        {
            "start": "2014-09-23T14:45:00.000Z",
            "end": "2014-09-23T15:15:00.000Z",
            "title": "Break",
            "type": "break",
            "subtitle": ""
        },
        {
            "start": "2014-09-23T15:15:00.000Z",
            "end": "2014-09-23T16:00:00.000Z",
            "title": "",
            "type": "free",
            "subtitle": ""
        },
        {
            "start": "2014-09-23T16:00:00.000Z",
            "end": "2014-09-23T16:30:00.000Z",
            "title": "",
            "type": "free",
            "subtitle": ""
        }
    ],
    "video_library": [
        {
            "id": "VFje117Ck7g",
            "speakers": "Oriol Jiménez",
            "vid": "VFje117Ck7g",
            "title": "Thinking of CPU & Memory (EN)",
            "topic": "Dev",
            "year": 2013,
            "thumbnailUrl": "http://img.youtube.com/vi/VFje117Ck7g/hqdefault.jpg",
            "desc": "Thinking of CPU & Memory by Oriol Jiménez (Antena Produccions SL)"
        },
        {
            "id": "sltjT72PoTk",
            "speakers": "Alexis Moussine-Pouchkine",
            "vid": "sltjT72PoTk",
            "title": "Mobile Backend Starter (FR)",
            "topic": "Dev",
            "year": 2013,
            "thumbnailUrl": "http://img.youtube.com/vi/sltjT72PoTk/hqdefault.jpg",
            "desc": "Mobile Backend Starter by Alexis Moussine-Pouchkine (Google)"
        },
        {
            "id": "PzwhZrTvHVA",
            "speakers": "Dominique Guinard",
            "vid": "PzwhZrTvHVA",
            "title": "Internet of things Barcodes, QRs, NFC, EPC & Arduino (EN)",
            "topic": "Dev",
            "year": 2013,
            "thumbnailUrl": "http://img.youtube.com/vi/PzwhZrTvHVA/hqdefault.jpg",
            "desc": "Internet of things Barcodes, QRs, NFC, EPC & Arduino by Dominique Guinard (EVRYTHNG)"
        },
        {
            "id": "EEUyO7hqJLU",
            "speakers": "Sylvain Galand",
            "vid": "EEUyO7hqJLU",
            "title": "Hack and protect your app (FR)",
            "topic": "Dev",
            "year": 2013,
            "thumbnailUrl": "http://img.youtube.com/vi/EEUyO7hqJLU/hqdefault.jpg",
            "desc": "Développeurs, hackez et protégez vos applications par Sylvain Galand (Genymobile)"
        },
        {
            "id": "BgP-QjjWCfA",
            "speakers": "Cédric Cabessa",
            "vid": "BgP-QjjWCfA",
            "title": "Discover embeded Linux with Android (EN)",
            "topic": "Dev",
            "year": 2013,
            "thumbnailUrl": "http://img.youtube.com/vi/BgP-QjjWCfA/hqdefault.jpg",
            "desc": "Discover embeded Linux with Android by Cédric Cabessa (Genymobile)"
        },
        {
            "id": "QVcXUi37AQY",
            "speakers": "Paul Lammertsma",
            "vid": "QVcXUi37AQY",
            "title": "Make It Fit, how Android measures and draws views (EN)",
            "topic": "Dev",
            "year": 2013,
            "thumbnailUrl": "http://img.youtube.com/vi/QVcXUi37AQY/hqdefault.jpg",
            "desc": "Make It Fit, how Android measures and draws views by Paul Lammertsma (Pixplicity)"
        },
        {
            "id": "ikqmL8jpOcQ",
            "speakers": "Johan Henricson",
            "vid": "ikqmL8jpOcQ",
            "title": "Best Practices For Boostraping your app's User Interface (EN)",
            "topic": "UI/UX",
            "year": 2013,
            "thumbnailUrl": "http://img.youtube.com/vi/ikqmL8jpOcQ/hqdefault.jpg",
            "desc": "Best Practices For Boostraping your app's User Interface by Johan Henricson (Sony)"
        },
        {
            "id": "eYhhCYjwjOs",
            "speakers": "Cédric Ravalec, Daniel Fages",
            "vid": "eYhhCYjwjOs",
            "title": "Genymotion (EN)",
            "topic": "Product announcement",
            "year": 2013,
            "thumbnailUrl": "http://img.youtube.com/vi/eYhhCYjwjOs/hqdefault.jpg",
            "desc": "Genymotion, new Android emulator by Cédric Ravalec & Daniel Fages (Genymobile)"
        },
        {
            "id": "fToroqYJWG0",
            "speakers": "Mark Kirstein",
            "vid": "fToroqYJWG0",
            "title": "Sneak peek preview of RhoMobile suite v4 (EN)",
            "topic": "Dev",
            "year": 2013,
            "thumbnailUrl": "http://img.youtube.com/vi/fToroqYJWG0/hqdefault.jpg",
            "desc": "Sneak peek preview of RhoMobile suite v4 by Mark Kirstein (Motorola Solutions)"
        },
        {
            "id": "UBHz-noN60I",
            "speakers": "Benjamin Zores",
            "vid": "UBHz-noN60I",
            "title": "Android Plateform Anatomy (EN)",
            "topic": "Dev",
            "year": 2013,
            "thumbnailUrl": "http://img.youtube.com/vi/UBHz-noN60I/hqdefault.jpg",
            "desc": "Android Plateform Anatomy by by Benjamin Zores (Alcatel-Lucent)"
        },
        {
            "id": "po3gtCfLqd8",
            "speakers": "Mathieu Hausherr, Aurelien Rambaux",
            "vid": "po3gtCfLqd8",
            "title": "Donnez le pouvoir a votre PO (FR)",
            "topic": "Dev",
            "year": 2013,
            "thumbnailUrl": "http://img.youtube.com/vi/po3gtCfLqd8/hqdefault.jpg",
            "desc": "Donnez le pouvoir de build a votre PO by Mathieu Hausherr (Octo Technology) & Aurelien Rambaux (Octo Technology)"
        },
        {
            "id": "8btE35YYk5o",
            "speakers": "Tim Messerschmidt",
            "vid": "8btE35YYk5o",
            "title": "Paypal's new Android SDK (EN)",
            "topic": "Dev",
            "year": 2013,
            "thumbnailUrl": "http://img.youtube.com/vi/8btE35YYk5o/hqdefault.jpg",
            "desc": "PayPal's new Android SDK -- kicking ass with payments by Tim Messerschmidt (PayPal)"
        },
        {
            "id": "bfaUN9Bk06o",
            "speakers": "Eyal Lezmy",
            "vid": "bfaUN9Bk06o",
            "title": "Secure your app, fight the leaks (EN)",
            "topic": "Dev",
            "year": 2013,
            "thumbnailUrl": "http://img.youtube.com/vi/bfaUN9Bk06o/hqdefault.jpg",
            "desc": "Secure your app, fight the leaks by Eyal Lezmy"
        },
        {
            "id": "8kRbcNIfKaQ",
            "speakers": "Olivier Gonthier",
            "vid": "8kRbcNIfKaQ",
            "title": "Android Testing (FR)",
            "topic": "Dev",
            "year": 2013,
            "thumbnailUrl": "http://img.youtube.com/vi/8kRbcNIfKaQ/hqdefault.jpg",
            "desc": "Android Testing by Olivier Gonthier (Zenika)"
        },
        {
            "id": "YIArVywQe8k",
            "speakers": "Cyril Mottier",
            "vid": "YIArVywQe8k",
            "title": "Crafting Custom Android Views (EN)",
            "topic": "Dev",
            "year": 2013,
            "thumbnailUrl": "http://img.youtube.com/vi/YIArVywQe8k/hqdefault.jpg",
            "desc": "Crafting Custom Android Views by Cyril Mottier (Capitaine Train)"
        },
        {
            "id": "zcSm7rsBnF0",
            "speakers": "Peter van der Linden",
            "vid": "zcSm7rsBnF0",
            "title": "It's all Fun & Games on Android (EN)",
            "topic": "Games",
            "year": 2013,
            "thumbnailUrl": "http://img.youtube.com/vi/zcSm7rsBnF0/hqdefault.jpg",
            "desc": "It's all Fun and Games on Android -- game coding without tears by Peter van der Linden (Immersion)"
        },
        {
            "id": "cSGHecvZhuQ",
            "speakers": "Alain Régnier",
            "vid": "cSGHecvZhuQ",
            "title": "Introduction à Google Glass (FR)",
            "topic": "Google Glass",
            "year": 2013,
            "thumbnailUrl": "http://img.youtube.com/vi/cSGHecvZhuQ/hqdefault.jpg",
            "desc": "Conférence d'introduction à Google Glass, réalisée pendant la Droidcon Paris 2013 par Alain Regnier le premier GlassExplorer français"
        }
    ],
    "hashtags": [
        {
            "color": "#303f9f",
            "order": 1,
            "name": "#droidconparis",
            "description": "Follow the general Google+ social conversation happening around Droidcon Paris"
        },
        {
            "color": "#303f9f",
            "order": 2,
            "name": "#droidcon",
            "description": "Follow the general Google+ social conversation happening around Droidcon"
        },
        {
            "color": "#303f9f",
            "order": 3,
            "name": "#paug",
            "description": "Follow the general Google+ social conversation happening around Paris Android User Group"
        },
        {
            "color": "#303f9f",
            "order": 4,
            "name": "#bemyapp",
            "description": "Follow the general Google+ social conversation happening around BeMyApp"
        }
    ],
    "rooms": [
        {
            "originalid": "auditorium",
            "id": "auditorium",
            "name": "Auditorium"
        },
        {
            "originalid": "leparisien",
            "id": "leparisien",
            "name": "Le Parisien"
        },
        {
            "originalid": "salon",
            "id": "salon",
            "name": "Salon"
        }
    ],
    "tags": [
        {
            "category": "TOPIC",
            "name": "Development",
            "color": "#A4C739",
            "abstract": "",
            "tag": "TOPIC_DEVELOPMENT",
            "originalid": "development",
            "orderincategory": 1
        },
        {
            "category": "TOPIC",
            "name": "Android Everywhere",
            "color": "#03A9F4",
            "abstract": "",
            "tag": "TOPIC_EVERYWHERE",
            "originalid": "everywhere",
            "orderincategory": 2
        },
        {
            "category": "TOPIC",
            "name": "UI/UX",
            "color": "#E91E63",
            "abstract": "",
            "tag": "TOPIC_UI_UX",
            "originalid": "uiux",
            "orderincategory": 3
        },
        {
            "category": "TOPIC",
            "name": "Other",
            "color": "#FFC107",
            "abstract": "",
            "tag": "TOPIC_OTHER",
            "originalid": "other",
            "orderincategory": 4
        },
        {
            "category": "TYPE",
            "name": "Français",
            "color": "",
            "abstract": "",
            "tag": "THEME_FR",
            "originalid": "french",
            "orderincategory": 2
        },
        {
            "category": "TYPE",
            "name": "English",
            "color": "",
            "abstract": "",
            "tag": "THEME_EN",
            "originalid": "english",
            "orderincategory": 2
        },
        {
            "category": "THEME",
            "name": "Beginner",
            "color": "",
            "abstract": "",
            "tag": "THEME_BEGINNER",
            "originalid": "beginner",
            "orderincategory": 1
        },
        {
            "category": "THEME",
            "name": "Intermediate",
            "color": "",
            "abstract": "",
            "tag": "THEME_INTERMEDIATE",
            "originalid": "intermediate",
            "orderincategory": 2
        },
        {
            "category": "THEME",
            "name": "Expert",
            "color": "",
            "abstract": "",
            "tag": "THEME_EXPERT",
            "originalid": "expert",
            "orderincategory": 3
        }
    ],
    "partners": [
        {
            "id": "microsoft",
            "name": "Microsoft",
            "desc": "",
            "website": "http://msdn.microsoft.com/fr-fr/",
            "logo": "http://fr.droidcon.com/2014/wp-content/uploads/2014/07/microsoft-logo-e1409750592884.png",
            "level": 1,
            "levelLabel": "Platinum"
        },
        {
            "id": "intel",
            "name": "Intel",
            "desc": "",
            "website": "https://software.intel.com/fr-fr/",
            "logo": "http://fr.droidcon.com/2014/wp-content/uploads/2014/07/Intel1-e1406737628760.png",
            "level": 2,
            "levelLabel": "Gold"
        },
        {
            "id": "evernote",
            "name": "Evernote",
            "desc": "",
            "website": "https://evernote.com/intl/fr/",
            "logo": "http://fr.droidcon.com/2014/wp-content/uploads/2014/09/logo-evernote-e1409750304612.png",
            "level": 2,
            "levelLabel": "Gold"
        },
        {
            "id": "octo",
            "name": "Octo",
            "desc": "",
            "website": "http://www.octo.com/fr",
            "logo": "http://fr.droidcon.com/2014/wp-content/uploads/2014/08/octo-e1408631768123.png",
            "level": 3,
            "levelLabel": "Silver"
        },
        {
            "id": "xebia",
            "name": "Xebia",
            "desc": "",
            "website": "http://www.xebia.fr/",
            "logo": "http://fr.droidcon.com/2014/wp-content/uploads/2014/08/xebia-e1408435445873.png",
            "level": 3,
            "levelLabel": "Silver"
        },
        {
            "id": "alcatel",
            "name": "Alcatel One Touch",
            "desc": "",
            "website": "http://www.alcatelonetouch.com/fr/",
            "logo": "http://fr.droidcon.com/2014/wp-content/uploads/2014/08/Alcatel-one-Touch-e1407320479604.png",
            "level": 3,
            "levelLabel": "Silver"
        },
        {
            "id": "idapps",
            "name": "iD.apps",
            "desc": "",
            "website": "http://www.id-apps.fr/",
            "logo": "http://fr.droidcon.com/2014/wp-content/uploads/2014/07/ID-APPS2-e1406736367296.jpg",
            "level": 3,
            "levelLabel": "Silver"
        },
        {
            "id": "paypal",
            "name": "PayPal",
            "desc": "",
            "website": "https://developer.paypal.com/",
            "logo": "http://fr.droidcon.com/2014/wp-content/uploads/2014/07/paypal2-e1408631882653.png",
            "level": 3,
            "levelLabel": "Silver"
        },
        {
            "id": "amazon",
            "name": "Amazon",
            "desc": "",
            "website": "https://developer.amazon.com/appsandservices/",
            "logo": "http://fr.droidcon.com/2014/wp-content/uploads/2014/08/amazon-logo1-e1409071753101.png",
            "level": 3,
            "levelLabel": "Silver"
        },
        {
            "id": "parse",
            "name": "Parse",
            "desc": "",
            "website": "https://parse.com/",
            "logo": "http://fr.droidcon.com/2014/wp-content/uploads/2014/09/Parse-logo1-e1409837171359.png",
            "level": 3,
            "levelLabel": "Silver"
        },
        {
            "id": "genymobile",
            "name": "Genymobile",
            "desc": "",
            "website": "http://www.genymobile.com/en/",
            "logo": "http://fr.droidcon.com/2014/wp-content/uploads/2014/09/a-e1409847200106.png",
            "level": 3,
            "levelLabel": "Silver"
        },
        {
            "id": "meilleurmobile",
            "name": "MeilleurMobile",
            "desc": "",
            "website": "http://www.meilleurmobile.com/",
            "logo": "http://fr.droidcon.com/2014/wp-content/uploads/2014/08/MeilleurMobile-e1408610813256.jpg",
            "level": 4,
            "levelLabel": "Media Partners"
        },
        {
            "id": "begeek",
            "name": "BeGeek",
            "desc": "",
            "website": "http://www.begeek.fr/",
            "logo": "http://fr.droidcon.com/2014/wp-content/uploads/2014/08/begeek-e1407148264929.png",
            "level": 4,
            "levelLabel": "Media Partners"
        },
        {
            "id": "frandroid",
            "name": "FrAndroid",
            "desc": "",
            "website": "http://www.frandroid.com/",
            "logo": "http://fr.droidcon.com/2014/wp-content/uploads/2014/08/FrAndroid-e1407147698739.png",
            "level": 4,
            "levelLabel": "Media Partners"
        },
        {
            "id": "developpez",
            "name": "Developpez.com",
            "desc": "",
            "website": "http://www.developpez.com/",
            "logo": "http://fr.droidcon.com/2014/wp-content/uploads/2014/07/logo-dvp-200x82-fond-blanc.png",
            "level": 4,
            "levelLabel": "Media Partners"
        },
        {
            "id": "jbmm",
            "name": "JBMM",
            "desc": "",
            "website": "http://www.jbmm.fr/",
            "logo": "http://fr.droidcon.com/2014/wp-content/uploads/2014/08/jbmm1-e1407515996871.jpg",
            "level": 5,
            "levelLabel": "Other Partners"
        },
        {
            "id": "korben",
            "name": "Korben",
            "desc": "",
            "website": "http://korben.info/",
            "logo": "http://fr.droidcon.com/2014/wp-content/uploads/2014/08/korben-e1407515682613.png",
            "level": 5,
            "levelLabel": "Other Partners"
        },
        {
            "id": "paug",
            "name": "Paris Android User Group",
            "desc": "",
            "website": "http://www.paug.fr/",
            "logo": "http://fr.droidcon.com/2014/wp-content/uploads/2014/07/Logo-PAUG-e1405428862647.png",
            "level": 6,
            "levelLabel": "Organizers"
        },
        {
            "id": "bemyapp",
            "name": "BeMyApp",
            "desc": "",
            "website": "http://events.bemyapp.com/",
            "logo": "http://fr.droidcon.com/2014/wp-content/uploads/2014/07/bemyapp1-e1405428927648.png",
            "level": 6,
            "levelLabel": "Organizers"
        }
    ]
}