{
    "speakers": [
        {
            "id": "janchong",
            "bio": "Jan Chong holds a BS and MS in Computer Science from Stanford University. She has Ph.D from the Management Science & Engineering Department, also from Stanford. She is currently the Engineering Manager for the Twitter Android Team. Prior to joining Twitter, Jan ran client and server software development at OnLive.",
            "name": "Jan Chong",
            "company": "Twitter",
            "plusoneUrl": "https://plus.google.com/107409019686006760010",
            "website": "",
            "twitter": "https://twitter.com/lessachu",
            "thumbnailUrl": "http://fr.droidcon.com/2014/wp-content/uploads/2014/07/Jan-Chong-222x222.png"
        },
        {
            "id": "aliparr",
            "bio": "Head of Mobile Platform Partnerships Engineering, EMEA, Facebook and Parse.\nAli Parr looks after the technical side of Mobile Platform Partnerships in EMEA, at Facebook in London. He is currently heading up the Mobile Platform Partnerships program for Facebook in EMEA, as well focusing on new developer acquisition. Ali is focused on building partnerships with developers across EMEA, through direct contact, public speaking opportunities, and mentoring events. Ali is also a mentor at Techstars in London, and The Family in Paris, providing advice and experience to high-potential startups. Prior to Facebook, Ali was the founder of Infinite Degree, a gaming startup that reached top 10 in Apple App Store across many regions including the US and the UK. Ali holds a Masters degree in Computer Science.",
            "name": "Ali Parr",
            "company": "Parse (Facebook Company)",
            "plusoneUrl": "https://plus.google.com/u/0/113580875107123926943",
            "website": "",
            "twitter": "https://twitter.com/alistairp",
            "thumbnailUrl": "http://fr.droidcon.com/2014/wp-content/uploads/2014/09/ali-parr-222x222.png"
        },
        {
            "id": "maleev",
            "bio": "Dima is a developer for about 10 years, making his way from junior to technical architect and manager of complex mobile solutions. In the past .NET developer, ex-leader of \"Lviv .NET User Group\" and one of the organizers of the \"Oh, Mobile!\"  community. A fan of mobile technology and javascript. Makes fun talks all around the world and plays american football:)",
            "name": "Dimka Maleev",
            "company": "N-iX",
            "plusoneUrl": "",
            "website": "",
            "twitter": "https://twitter.com/dimko1",
            "thumbnailUrl": "http://devfest.gdg.org.ua/img/people/DimaMaleev.jpg"
        }
    ]
}